Revit 2027 API
BuiltInFailures.GroupFailures.GroupsNotCompatibleForTypeChange Property
 Some of the selected groups are not compatible with the new group type that was chosen.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupsNotCompatibleForTypeChange { get; }
Public Shared ReadOnly Property GroupsNotCompatibleForTypeChange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupsNotCompatibleForTypeChange {
	FailureDefinitionId^ get ();
}
static member GroupsNotCompatibleForTypeChange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace